{
  "dramas": [
    {
      "id": 1,
      "src": "../../../assets/img/ml.jpg",
      "cast": "Lee Joon-gi, Kang Ha-neul, IU",
      "genres": "Drama, Romance, Historical",
      "type": "k",
      "name": "Moon Lovers",
      "year": "2016",
      "rating": 0,
      "episodes": "20 episodes",
      "sinopsis": "During a total solar eclipse, a 25-year-old 21st-century woman, Go Ha-jin, is transported back in time, to the Goryeo Dynasty. She wakes up in the year of 941, in the body of Hae Soo, among the many princes of the ruling Wang family, during the reign of King Taejo."
    },
    {
      "id": 2,
      "src": "../../../assets/img/w.jpg",
      "cast": "Lee Jong-suk, Han Hyo-joo, Jung Yoo-jin",
      "genres": "Romance, Sci-fi",
      "type": "k",
      "name": "W",
      "year": "2016",
      "rating": 0,
      "episodes": "16 episodes",
      "sinopsis": "The series focuses on the eponymous fictional webtoon entitled W, written and illustrated by its legendary author and illustrator Oh Seong-moo (Kim Eui-sung) which begins to function on its own, like a distinct reality. W became so famous in South Korea that even its printed versions became best-sellers there."
    },
    {
      "id": 3,
      "src": "../../../assets/img/Are_You_Human.jpg",
      "cast": "Seo Kang-joon, Gong Seung-yeon, Lee Jun-hyuk",
      "genres": "Drama, Romance, Sci-fi",
      "type": "k",
      "name": "Are you human too?",
      "year": "2018",
      "rating": 0,
      "episodes": "36 episodes",
      "sinopsis": "Oh Laura, a renowned scientist, was forced to part with her young son, Nam Shin. To cope with her loss, over the years, she builds various AI robots modelled after him, naming them Nam Shin I, II and III. Decades later, after surviving an attempt on his life, Nam Shin slips into a coma. To protect his position as the heir to a chaebol, Laura sends Nam Shin III to take his place and fulfil his duties."
    },
    {
      "id": 4,
      "src": "../../../assets/img/flower.jpg",
      "cast": "Lee Joon-gi, Moon Chae-won, Kim Ji-hoon",
      "genres": "Drama, Romance, Thriller",
      "type": "k",
      "name": "Flower of evil",
      "year": "2020",
      "rating": 0,
      "episodes": "16 episodes",
      "sinopsis": "Cha Ji-Won is a detective. She is married to Baek Hee-Sung and they a daughter. Baek Hee-Sung seems like a committed husband and father, but he hides his cruel past and lives under another person's identity. He deceives his wife completely. Cha Ji-Won learns of his deception and chases his past."
    },
    {
      "id": 5,
      "src": "../../../assets/img/ars.jpg",
      "cast": "Xu Kai, Bai Lu, Wu Jiayi",
      "type": "c",
      "name": "Arsenal Military Academy",
      "genres": "Drama, Romance, Historical",
      "year": "2019",
      "rating": 0,
      "episodes": "48 episodes",
      "sinopsis": "Hoping to follow in her deceased brother's footsteps, Xie Xiang enrolls into the Arsenal Military Academy in Shunyuan disguised as a male, with only her good friend Tan Xiaojun knowing her secret. There, she becomes good friends with the country bumpkin Huang Song and the quiet Shen Junsan, all while getting into periodic quarrels with her hot-headed and playful roommate, Gu Yanzheng. Despite her small stature and weak constitution, she gradually trains into an able soldier, winning the respect of her peers."
    },
    {
      "id": 6,
      "src": "../../../assets/img/squid.jpg",
      "cast": "Li Xian, Hu Yitian, Yang Zi",
      "genres": "Romance, Comedy",
      "type": "c",
      "name": "Go Go Squid!",
      "year": "2019",
      "rating": 0,
      "episodes": "41 episodes",
      "sinopsis": "Tong Nian, an intelligent school girl, meets Han Shangyan, a passionate young man, who had dedicated his life to winning a world championship for China. Even though Han has a deep sense of responsibility to his teammates, he has trouble communicating and expressing his emotions. With Tong's understanding and support, Han gradually begins to open up to his brothers and family members. The two support and encourage each other as they work towards their dream to win a championship. Along the way, they motivate others to pursue their dreams as well."
    },
    {
      "id": 7,
      "src": "../../../assets/img/mg.jpg",
      "cast": "Dylan Wang, Shen Yue, Darren Chen",
      "genres": "Romance, Comedy",
      "type": "c",
      "name": "Meteor Garden",
      "year": "2018",
      "rating": 0,
      "episodes": "49 episodes",
      "sinopsis": "The story centers around an ordinary girl, Dong Shancai, who is accepted into the most prestigious university in the country, Ming De University. Shancai is a girl from a family that barely makes ends meet. Due to the nature of her personality, she immediately clashes with F4, an elite clique composed of the four most popular boys in the institution, especially its spoiled, rich and arrogant leader - Daoming Si. Gradually, Daoming Si falls deeply in love with Shancai, only to realize that she is in love with one of his best friends, Huaze Lei."
    },
    {
      "id": 8,
      "src": "../../../assets/img/fall.jpg",
      "cast": "Xu Kai, Cheng Xiao, Yao Chi",
      "genres": "Romance, Comedy",
      "type": "c",
      "name": "Falling into your smile",
      "year": "2021",
      "rating": 0,
      "episodes": "31 episodes",
      "sinopsis": "In the ultra-competitive world of e-sports, the all-male ZGDX OPL team is second to none. Armies of adoring female fans follow the team wherever it goes. But when one of the team’s star players suffers a hand injury, the tall, handsome, and notoriously hard-to-please ZGDX captain Lu Si Cheng will not be rushed into choosing a replacement."
    },
    {
      "id": 9,
      "src": "../../../assets/img/59.jpg",
      "cast": "Tomohisa Yamashita, Satomi Ishihara, Hyoga Takada",
      "genres": "Romance, Comedy",
      "type": "j",
      "name": "5 to 9",
      "year": "2015",
      "rating": 0,
      "episodes": "10 episodes",
      "sinopsis": "Junko Sakuraba is a 29-year-old English teacher who dreams of working in New York. One day, she causes an embarrassing accident resulting in her encountering a handsome Buddhist priest during a funeral service at a temple. Hoping to never meet him again, she is later deceived by her family and forced to go to a matchmaking session. The other party is none other than that priest, Takane Hoshikawa."
    },
    {
      "id": 10,
      "src": "../../../assets/img/kimi.jpg",
      "cast": "Koyuki, Jun Matsumoto, Satomi Ishihara",
      "genres": "Romance, Comedy",
      "type": "j",
      "name": "Kimi wa Petto",
      "year": "2003",
      "rating": 0,
      "episodes": "10 episodes",
      "sinopsis": "In education, career, and appearance... Sumire is perfect, too perfect for even her boyfriend, who summarily dumps her. Also sexually harassed at work, Sumire takes matters into her own hands. Returning home depressed and lonely, she finds a young man, Takeshi, injured inside a cardboard box. She takes him in, but can't get him to leave, so she offers to keep him if he agrees to become her pet. With nowhere else to go, Takeshi accepts and immediately takes to his new role. While they are cultivating their relationship as master and pet."
    },
    {
      "id": 11,
      "src": "../../../assets/img/min.jpg",
      "cast": "Taishi Nakagawa, Maika Yamamoto, Mirai Suzuki",
      "genres": "Romance, Comedy, Sci-fi",
      "type": "j",
      "name": "My little lover",
      "year": "2015",
      "rating": 0,
      "episodes": "10 episodes",
      "sinopsis": "Shunichi Minami possesses good looks and does well academically in high school. Chiyomi Horikiri is a bright girl who likes dancing. They were childhood friends and also their first loves, but after Shunichi Minami’s father disappeared they hardly talk. On a stormy night, Chiyomi Horikiri has an argument with her parents over her future plans and leaves home. While trying to avoid the rain, Chiyomi Horikiri wishes that she could go back to her childhood. Suddenly, Chiyomi becomes 15 cm. tall. Shunichi Minami happens to see tiny Chiyomi Horikiri."
    },
    {
      "id": 12,
      "src": "../../../assets/img/hana.jpg",
      "cast": "Maki Horikita, Shun Oguri, Toma Ikuta",
      "genres": "Romance, Comedy",
      "type": "j",
      "name": "Hanazakari kimitachi",
      "year": "2007",
      "rating": 0,
      "episodes": "12 episodes",
      "sinopsis": "This hilarious comedy follows the chaos, troubles, and friendship at a boys' boarding school after a girl disguised as a boy joins. Ashiya Mizuki has just come back to Japan from California where she was raised. She fell in love with Sano Izumi, a hopeful high jump hero, who has quit after an accident. As she wants him to go back to the sport once again, she enters the same high school as a boy! With short hair, a flattened chest, and lowered voice, she starts sharing the same room with Sano."
    },
    {
      "id": 13,
      "src": "../../../assets/img/just.jpeg",
      "cast": "Aaron Yan, Puff Kuo, Katherine Wang",
      "genres": "Romance, Comedy",
      "type": "tw",
      "name": "Just you",
      "year": "2013",
      "rating": 0,
      "episodes": "21 episodes",
      "sinopsis": "Qi Yi is a boss from hell, worse than a dictator. He is the saboteur of office romance. Cheng Liang Liang is tasked by her coworkers to break down the boss' defenses and convince him to lift the anti-office-romance rule. But will the two of them find themselves falling for each other along the way?"
    },
    {
      "id": 14,
      "src": "../../../assets/img/bro.jpg",
      "cast": "Baron Chen, Megan Lai, Katie Chen",
      "genres": "Romance, Drama, Comedy",
      "type": "tw",
      "name": "Bromance",
      "year": "2015",
      "rating": 0,
      "episodes": "18 episodes",
      "sinopsis": "When Pi Ya Nuo was born, her arrival was eagerly received by her parents, extended family, and their fortune teller, who gathered in the delivery room to bless the beginning of the Pi Family's heir. Upon hearing her first cry, the fortune teller predicted on the spot that the baby boy would grow up to be a great success and a natural-born leader. But when the nurses announced that the baby was a girl, it changed."
    },
    {
      "id": 15,
      "src": "../../../assets/img/back.jpg",
      "cast": "Marcus Chang, Ivy Shao, Mini Tsai",
      "genres": "Drama, Romance, Comedy",
      "type": "tw",
      "name": "Back to 1989",
      "year": "2016",
      "rating": 0,
      "episodes": "34 episodes",
      "sinopsis": "Chen Che doesn't know who his father was and the topic is a taboo in the Chen family. When an accident threw him back to 1989, a year before he was born, he gets a chance to find out himself. Before he could locate his mother, he first meets her best friend, Ye Zhen Zhen, a wholesome girl who helps him navigate the past while he helps her land big clients with his expert knowledge of stock market trend. Through her, he gets to know his younger, happier mom and the possible candidates for his father."
    },
    {
      "id": 16,
      "src": "../../../assets/img/pm.jpg",
      "cast": "Ivy Shao, Chris Wu, Ben Wu",
      "genres": "Romance, Comedy",
      "type": "tw",
      "name": "The Perfect Match",
      "year": "2017",
      "rating": 0,
      "episodes": "22 episodes",
      "sinopsis": "Huo Ting En is a renowned chef who trained at Le Cordon Bleu in Paris. He specializes in Curry dishes from Japan, Thailand, Malaysia, Sri Lanka, and India at his restaurant, La Mure. He crosses paths with Night Market chef Wei Fen Qing after netizens claim that her dishes are a cheaper version of his. Love eventually blooms between the two, but their union is hindered by a past secret."
    },
    {
      "id": 17,
      "src": "../../../assets/img/tb.jpg",
      "cast": "Cha Eun-woo, Hwang In-yeop, Moon Ga-young",
      "genres": "Romance, Comedy",
      "type": "k",
      "name": "True Beauty",
      "year": "2020",
      "rating": 0,
      "episodes": "16 episodes",
      "sinopsis": "Im Ju-Kyung is a high school student. Since she was little, she has had a complex about her appearance. To hide her bare face, Im Ju-Kyung always wears make-up."
    },
    {
      "id": 18,
      "src": "../../../assets/img/dots.jpg",
      "cast": "Song Joong-ki, Song Hye-kyo, Kim Ji-won",
      "genres": "Romance, Drama",
      "type": "k",
      "name": "Descendants of the Sun",
      "year": "2016",
      "rating": 0,
      "episodes": "16 episodes",
      "sinopsis": "A love story develops between Captain Yoo Shi Jin, from South Korean Special Forces and Doctor Kang Mo Yeon, who works as a Surgeon at Haesung Hospital in Seoul."
    },
    {
      "id": 19,
      "src": "../../../assets/img/30.jpg",
      "cast": "Yang Se-jong, Ahn Hyo-seop, Shin Hye-sun",
      "genres": "Romance, Drama",
      "type": "k",
      "name": "Still 17",
      "year": "2018",
      "rating": 0,
      "episodes": "32 episodes",
      "sinopsis": "Gong Woo-jin (Yang Se-jong) is a 30-year-old single man who works as a set designer. Due to a trauma he experienced 13 years ago, he does not want to have a relationship with others. When Woo Seo-ri (Shin Hye-sun) was 17, she fell into a coma."
    },
    {
      "id": 20,
      "src": "../../../assets/img/bb.jpg",
      "cast": "Han Ye-seul, Joo Sang-wook, Jung Gyu-woon",
      "genres": "Romance, Comedy",
      "type": "k",
      "name": "Birth of a beauty",
      "year": "2014",
      "rating": 0,
      "episodes": "21 episodes",
      "sinopsis": "Overweight, kind-hearted Sa Geum-ran (Ha Jae-sook) married into a well-to-do family, but her husband Lee Kang-joon (Jung Gyu-woon) has spent the past seven years in the United States for his business, and Sa Geum-ran has lived with her mother-in-law and sisters-in-law who treats her badly."
    },
    {
      "id": 21,
      "src": "../../../assets/img/sb.jpg",
      "cast": "Yeon Woo-jin, Park Hye-soo, Yoon Park",
      "genres": "Romance, Comedy, Drama",
      "type": "k",
      "name": "My shy boss",
      "year": "2017",
      "rating": 0,
      "episodes": "16 episodes",
      "sinopsis": "Eun Hwan-ki (Yeon Woo-jin) is the CEO of a public relations company, but he is extremely shy. Due to his personality his employees do not know him well."
    },
    {
      "id": 22,
      "src": "../../../assets/img/happy.jpg",
      "cast": "Tang Xiaotian, Xing Fei, Huang Yilin",
      "genres": "Romance, Comedy",
      "type": "c",
      "name": "My little happiness",
      "year": "2021",
      "rating": 0,
      "episodes": "28 episodes",
      "sinopsis": "Cong Rong has long dreamed of becoming a lawyer, but her mother is absolutely determined to see her daughter study finance abroad. Hoping that her daughter will successfully settle down somewhere overseas, Cong Rong’s mother won’t take “no” for an answer."
    },
    {
      "id": 23,
      "src": "../../../assets/img/star.jpg",
      "cast": "Huang Zitao",
      "genres": "Romance, Comedy",
      "type": "c",
      "name": "The brightest star in the sky",
      "year": "2019",
      "rating": 0,
      "episodes": "44 episodes",
      "sinopsis": "Star Entertainment is the top entertainment agency in China. It was set up by a couple, Cheng Tian Hao and Du Wan Qing, who eventually separated due to differing beliefs in managing the company."
    }
  ],
  "list": [
    {
      "src": "../../../assets/img/ml.jpg",
      "cast": "",
      "type": "k",
      "genres": "Drama, Romance, Historical",
      "year": "2016",
      "episodes": "20 episodes",
      "name": "Moon Lovers",
      "sinopsis": "During a total solar eclipse, a 25-year-old 21st-century woman, Go Ha-jin, is transported back in time, to the Goryeo Dynasty. She wakes up in the year of 941, in the body of Hae Soo, among the many princes of the ruling Wang family, during the reign of King Taejo.",
      "rating": 9.5,
      "id": 3
    },
    {
      "src": "../../../assets/img/tb.jpg",
      "cast": "",
      "type": "k",
      "genres": "Romance, Comedy",
      "year": "2020",
      "episodes": "16 episodes",
      "name": "True Beauty",
      "sinopsis": "Im Ju-Kyung is a high school student. Since she was little, she has had a complex about her appearance. To hide her bare face, Im Ju-Kyung always wears make-up.",
      "rating": 10,
      "id": 17
    },
    {
      "src": "../../../assets/img/bro.jpg",
      "cast": "",
      "type": "tw",
      "genres": "Romance, Drama, Comedy",
      "year": "2015",
      "episodes": "18 episodes",
      "name": "Bromance",
      "sinopsis": "When Pi Ya Nuo was born, her arrival was eagerly received by her parents, extended family, and their fortune teller, who gathered in the delivery room to bless the beginning of the Pi Family's heir. Upon hearing her first cry, the fortune teller predicted on the spot that the baby boy would grow up to be a great success and a natural-born leader. But when the nurses announced that the baby was a girl, it changed.",
      "rating": 8,
      "id": 14
    },
    {
      "src": "../../../assets/img/w.jpg",
      "cast": "",
      "type": "k",
      "genres": "Romance, Sci-fi",
      "year": "2016",
      "episodes": "16 episodes",
      "name": "W",
      "sinopsis": "The series focuses on the eponymous fictional webtoon entitled W, written and illustrated by its legendary author and illustrator Oh Seong-moo (Kim Eui-sung) which begins to function on its own, like a distinct reality. W became so famous in South Korea that even its printed versions became best-sellers there.",
      "rating": 5,
      "id": 2
    }
  ]
}